# "Hello, World!" в 67 строк кода на Python

from time import sleep as sl # Модуль задержки сообщений

h = 'H' # Переменная h
e = 'e' # Переменная e
l = 'l' # Переменная l
l = 'l' # Дублирование переменной l (не знаю, зачем)
o = 'o' # Переменная o
comma = ',' # Переменная comma (запятая)
w = 'W' # Переменная w
o = 'o' # Дублирование переменной o (не знаю, зачем)
r = 'r' # Переменная r
l = 'l' # Второе дублирование переменной l
d = 'd' # Перемення d
exclamationpoint = '!' # Переменная exclamationpoint (восклицательный знак)

sl(3) # Задержка сообщения на 3 секунды

def question(): # Блок question
	question1 = input('Вы хотите получить "Hello, World!" в 67 строк кода?: ') # Переменная question1, которая задаёт вопрос
	if question1.lower() in ( # Если переменная question 1 равна:
		'да',
		'конечно',
		'естественно',
		'ага',
		'угу',
		'хочу'
		):
		sl(2) # Задержка сообщения на 2 секунды
		print('Получайте!...') # Вывести на экран
	elif question1.lower() in ( # Иначе если переменная question равна:
		'нет',
		'неа',
		'не хочу',
		'не надо',
		'не'
		):
		sl(2) # Задержка сообщения на 2 секунды
		print('До свидания!') # Вывести на экран
		exit() # Завершить программу
	else: # Ещё (если не попадём ни в if, ни в elif):
		sl(2) # Задержка сообщения на 2 секунды
		print('Не понимаю команды, повторите попытку...') # Вывести на экран
		return question() # Вернуться в начало блока question
question() # Запуск блока question

sl(3) # Задержка сообщения на 3 секунды

def helloworld(): # Блок helloworld
	print( # Вывести на экран:
		f'{h}'
		f'{e}'
		f'{l}'
		f'{l}'
		f'{o}'
		f'{comma}'
		' '
		f'{w}'
		f'{o}'
		f'{r}'
		f'{l}'
		f'{d}'
		f'{exclamationpoint}'
		)
	sl(3)
helloworld() # Запуск блока helloworld